app/controllers/application_controller.rb

  def current_user
    # [취약점] 세션에서 user_id만 확인, 추가 검증 없음
    @current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]