app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE (email = 'lodossw@gmail.com' AND password = '1234') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def create
    email = params[:email]
    password = params[:password]

    # [취약점] SQL Injection - 사용자 입력을 직접 쿼리에 삽입
    # 예: email에 ' OR '1'='1' -- 입력 시 인증 우회 가능
    user = User.where("email = '#{email}' AND password = '#{password}'").first