app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password", "is_admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "lodossw@gmail.com"], ["name", "이종석"], ["password", "12345"], ["is_admin", false], ["created_at", "2026-01-17 15:35:34.723730"], ["updated_at", "2026-01-17 15:35:34.723730"]]
---
  def create
    # [취약점] Mass Assignment - 모든 파라미터 허용
    # is_admin=true 를 전송하면 관리자 계정 생성 가능
    @user = User.new(params.require(:user).permit!)

    if @user.save

SELECT "users".* FROM "users"
---
  def index
    @users = User.all